InformationRegisters/упЗанятостьТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упЗанятостьТранспорта</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаОкончания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаНачала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеТранспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактНачала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактОкончания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Транспорт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаРемонтИТОТС</v8:Type>
						<v8:Type>cfg:DocumentRef.упИзменениеСостоянияТранспортногоСредства</v8:Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
						<v8:Type>cfg:DocumentRef.упРемонтИТОТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упРасписаниеРаботыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упРасписаниеРаботыТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>_ЗонаЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>_ЗонаНачала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
						<v8:Type>cfg:DocumentRef.упРемонтИТОТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРасписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыРасписанийРаботыТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упЗанятостьТранспорта/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет проверку на пересечение периодов занятости транспортного средства,
//  после проведения документа.
//
// Параметры:
//  ДокументОбъект		 - ДокументОбъект.упРейс					 - ДокументОбъект.упРемонтИТОТС, объект документа.
//  ТранспортноеСредство	 - СправочникСсылка.упТранспортныеСредства	 - транспортное средство.
//  Отказ				 - Булево								 - Признак проведения документа.
//  ПроверятьТолькоФакт	 - Булево								 - проверять только факт.
//
Процедура ВыполнитьКонтрольРезультатовПроведения(ДокументОбъект, ТранспортноеСредство, Отказ, ПроверятьТолькоФакт = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
"ВЫБРАТЬ
|	упРасписаниеРаботыТС.Документ КАК Документ,
|	упРасписаниеРаботыТС.ДатаНачала КАК ДатаНачала,
|	ДОБАВИТЬКДАТЕ(упРасписаниеРаботыТС.ДатаОкончания, СЕКУНДА, упРасписаниеРаботыТС.Транспорт.ПерерывМеждуРейсами * 3600) КАК ДатаОкончания,
|	ЛОЖЬ КАК ЭтоФакт
|ПОМЕСТИТЬ втПериодыДоступности
|ИЗ
|	РегистрСведений.упЗанятостьТранспорта.СрезПоследних КАК упРасписаниеРаботыТС
|ГДЕ
|	упРасписаниеРаботыТС.Транспорт = &ТранспортноеСредство И &ПроверятьТолькоФакт <> ИСТИНА
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	упРасписаниеРаботыТС.ДокументОснование,
|	упРасписаниеРаботыТС.ДатаНачала,
|	упРасписаниеРаботыТС.ДатаОкончания,
|	ИСТИНА
|ИЗ
|	РегистрСведений.упРасписаниеРаботыТС КАК упРасписаниеРаботыТС
|ГДЕ
|	упРасписаниеРаботыТС.ТранспортноеСредство = &ТранспортноеСредство
|
|ИНДЕКСИРОВАТЬ ПО
|	упРасписаниеРаботыТС.Документ
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ПД1.Документ КАК Документ1,
|	ПД2.Документ КАК Документ2
|ИЗ
|	втПериодыДоступности КАК ПД1
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПериодыДоступности КАК ПД2
|		ПО (НЕ ПД1.Документ = ПД2.Документ)
|			И (ПД1.Документ = &Документ)
|			И (ВЫБОР
|				КОГДА ПД1.ДатаНачала МЕЖДУ ПД2.ДатаНачала И ПД2.ДатаОкончания
|					ТОГДА ИСТИНА
|				КОГДА ПД1.ДатаОкончания МЕЖДУ ПД2.ДатаНачала И ПД2.ДатаОкончания
|					ТОГДА ИСТИНА
|				КОГДА ПД2.ДатаНачала МЕЖДУ ПД1.ДатаНачала И ПД1.ДатаОкончания
|					ТОГДА ИСТИНА
|				КОГДА ПД2.ДатаОкончания МЕЖДУ ПД1.ДатаНачала И ПД1.ДатаОкончания
|					ТОГДА ИСТИНА
|				ИНАЧЕ ЛОЖЬ
|			КОНЕЦ)
|
|УПОРЯДОЧИТЬ ПО
|	ПД2.ЭтоФакт УБЫВ";
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	Запрос.УстановитьПараметр("Документ", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПроверятьТолькоФакт", ПроверятьТолькоФакт);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ТекстСообщения = НСтр(СтрШаблон("ru = 'Транспортное средство ""%1"" занято на период документа документом %3. Проведение не выполнено. %2'",
			Строка(ТранспортноеСредство), Строка(ДокументОбъект), Выборка.Документ2));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтрольРезультатовПроведения()

#КонецОбласти 

#КонецЕсли
